БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_СписаниеЗатратНаРеализацию</Name>
			<BasedOn>
				<xr:Item>Document.CW_ДоходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыНаРеализацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантУчетаНЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантУчетаНЗП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Директивно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_СписаниеЗатратНаРеализацию/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	ВалютаРег = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда
		Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
	Конецесли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = CW_Документы.РабочееВремя();
	КонецЕсли;
	
	ПоказатьПодразделение = ложь;
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		ПоказатьПодразделение = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ГруппировкаЗатратПоПодразделениям");
	КонецЕсли;
	
	Элементы.ЗатратыПодразделение.Видимость = ПоказатьПодразделение;
	
	ТекущийДокументОснование = Объект.ДокументОснование;
	
	УстанавиливаемыеПараметры = Новый Структура("CW_ДоговорПоГрузоперевозкам", ТекущийДокументОснование.Договор);
	Элементы.ПриложениеКДоговору.Видимость = ПолучитьФункциональнуюОпцию("CW_УчитыватьПриложенияВДокументах",УстанавиливаемыеПараметры); 
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП

	ПроверитьВозмоностьЗаполненияДокумента();
	
	УстановитьВидимостьСпособУчетаНДСНаСервере();
	
	ЗаполнитьДополнительныеКолонки();

	НачальнаяДатаДокумента = Объект.Дата;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	//Внешние подклчюаемые команды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ЗаполнитьДополнительныеКолонки();

	НачальнаяДатаДокумента 	= Объект.Дата;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Затраты", "Договор");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки() 

	Для каждого СтрокаДокумента Из Объект.Затраты Цикл
		СтрокаДокумента.ВалютаРег = ВалютаРег;
	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ЗаполнитьДополнительныеКолонки();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Затраты", "Договор");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПроверитьВозмоностьЗаполненияДокумента();
	УстановитьВидимостьСпособУчетаНДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСпособУчетаНДСНаСервере()
	
	УстанавливаемыеПараметры = Новый Структура;
	УстанавливаемыеПараметры.Вставить("Организация", Объект.Организация);
	
	Элементы.ЗатратыСпособУчетаНДС.Видимость = ПолучитьФункциональнуюОпцию("РаздельныйУчетНДСНаСчете19",УстанавливаемыеПараметры);

КонецПроцедуры

//Команды табличной части
&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен документ реализации!",,"ДокументОснование","Объект", Отказ);
	КонецЕсли;
	
	Если Не Отказ тогда
		
		ДополнительныеПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнить", ЭтотОбъект, ДополнительныеПараметры);
		
		Если Объект.Затраты.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Режим = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
		Иначе
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТабличнуюЧастьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере(РезультатПодбора = Неопределено)
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата", 						Объект.Дата);
	ПараметрыЗаполнения.Вставить("Организация", 				Объект.Организация);
	ПараметрыЗаполнения.Вставить("ПодразделениеОрганизации",	Объект.ПодразделениеОрганизации);
	ПараметрыЗаполнения.Вставить("Ссылка", 						Объект.ДокументОснование);
	ПараметрыЗаполнения.Вставить("Контрагент", 					Объект.ДокументОснование.Контрагент);
	ПараметрыЗаполнения.Вставить("Договор", 					Объект.ДокументОснование.Договор);
	ПараметрыЗаполнения.Вставить("ПриложениеКДоговору",			Объект.ДокументОснование.ПриложениеКДоговору);
	
	РезультатЗапроса = ТОбъект.ПолучитьДанныеДляЗаполненияТабличнойЧасти(ПараметрыЗаполнения, РезультатПодбора);
	
	Объект.Затраты.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Объект.Затраты.Очистить();
	Объект.ПодразделениеОрганизации = Объект.ДокументОснование.ПодразделениеОрганизации;
	ТекущийДокументОснование = Объект.ДокументОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	Оповещение = Новый ОписаниеОповещения("ПродолжитьДокументОснованиеПриИзменении", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Затраты.Количество() > 0 и ЗначениеЗаполнено(ТекущийДокументОснование) и ТекущийДокументОснование <> Объект.ДокументОснование Тогда
		СтандартнаяОбработка = Ложь;
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДокументОснованиеПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ДокументОснование =  ТекущийДокументОснование;
		Возврат;
	КонецЕсли;
	
	ДокументОснованиеПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеДокументаоснования", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Затраты.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИзменениеДокументаоснования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", 				Объект.Организация);
	СтруктураОтбора.Вставить("ПодразделениеОрганизации", 	Объект.ПодразделениеОрганизации);
	СтруктураОтбора.Вставить("ФормируетсяАкт", 				Истина);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", 		Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор", 				СтруктураОтбора);
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора", ПараметрыФормыВыбора, ДополнительныеПараметры.Элемент);

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Если Объект.Затраты.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуТабличнойЧасти", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОчисткуТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Затраты.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресПодобранныхДанных = ПолучитьАдресТаблицыПодобранныхДанных();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаСреза", 				Объект.Дата);
	ПараметрыФормы.Вставить("Организация", 				Объект.Организация);
	ПараметрыФормы.Вставить("ПодразделениеОрганизации",	Объект.ПодразделениеОрганизации);
	ПараметрыФормы.Вставить("ДокументОснование", 		Объект.ДокументОснование);
	ПараметрыФормы.Вставить("АдресПодобранныхДанных", 	АдресПодобранныхДанных);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПодборСтрок", ЭтотОбъект);
	
	ОткрытьФорму("Документ.CW_СписаниеЗатратНаРеализацию.Форма.ФормаПодбораЗатрат", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&наКлиенте
Процедура ПродолжитьПодборСтрок(АдресТаблицы, ДополнительныеПараметры) Экспорт

	Если АдресТаблицы = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(АдресТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьПодборСтрокНаСервере(АдресТаблицы);

КонецПроцедуры

&наСервере
Процедура ПродолжитьПодборСтрокНаСервере(АдресТаблицы)
	
	Объект.Затраты.Очистить();
	
	РезультатПодбора = ПолучитьИзВременногоХранилища(АдресТаблицы);
	ЗаполнитьТабличнуюЧастьНаСервере(РезультатПодбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыПодобранныхДанных()
	
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		|	CW_СписаниеЗатратНаРеализациюЗатраты.ДокументРасходов КАК ДокументРасходов,
		|	CW_СписаниеЗатратНаРеализациюЗатраты.Номенклатура КАК Номенклатура,
		|	CW_СписаниеЗатратНаРеализациюЗатраты.Всего_Валюта КАК Всего_Валюта
		|ИЗ
		|	Документ.CW_СписаниеЗатратНаРеализацию.Затраты КАК CW_СписаниеЗатратНаРеализациюЗатраты";
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаДокумента = РезультатЗапроса.Выгрузить();
		
	Иначе  
		
		ТаблицаДокумента = Объект.Затраты.Выгрузить().Скопировать(,"ДокументРасходов,Номенклатура,Всего_Валюта");
		ТаблицаДокумента.Свернуть("ДокументРасходов,Номенклатура", "Всего_Валюта");
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДокумента, УникальныйИдентификатор);
	
КонецФункции


//Команды табличной части



//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()

	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов 


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Наличие прикрепленных файлов
	Если ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
	КонецЕсли;
	
КонецПроцедуры
//Наличие прикрепленных файлов

//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

//Внешние подклчюаемые команды


//Изменение даты документа
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если ГодИзменился() Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияГода",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Дата документа перенесена в другой год."+Символы.ПС+ 
			"Документу будет присвоен новый номер."+Символы.ПС+ 
			"Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзмененияГода(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		// присваевам новый номер
		ОбработатьИзменениеГода();
	Иначе
		// восстанавливаем дату по ссылке
		ВосстановитьДатуДокумента();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ГодИзменился()
	Возврат Год(Объект.Дата) <> Год(НачальнаяДатаДокумента);
КонецФункции


&НаСервере
Процедура ОбработатьИзменениеГода()

	НачальнаяДатаДокумента = Объект.Дата;
	ПолучитьНомер(); 
	
КонецПроцедуры 

&НаСервере
Процедура ПолучитьНомер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДатуДокумента()
	
	Объект.Дата = НачальнаяДатаДокумента;
	ДатаПриИзмененииНаСервере(); 
	
КонецПроцедуры

 &НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	// если очистили дату, то принудительно 
	// устанавливаем текущую дату
	Если Объект.Дата = Дата(1,1,1) Тогда
		Объект.Дата = CW_Документы.РабочееВремя();
	КонецЕсли;
	
КонецПроцедуры
//Изменение даты документа



&НаСервере
Процедура ПроверитьВозмоностьЗаполненияДокумента()  
	
	Дата = ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	ПараметрыУчетнойПолитики		= CW_Настройки.ПараметрыУчетнойПолитики(Дата, Объект.Организация);  
	ВариантУчетаНЗПУчетнойПолитики	= ПараметрыУчетнойПолитики["ВариантУчетаНЗП"];

	ОтключеноУчетнойПолитикой = Ложь;
	
	ЧастиЗаголовка = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ВариантУчетаНЗПУчетнойПолитики <> ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Директивно") Тогда 
		
		КлючЗаписи = ПолучитьКлючЗаписи(ПараметрыУчетнойПолитики["Период"]);
	    НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(КлючЗаписи);
		
		ЧастиЗаголовка.Добавить(
		НСтр("ru = 'Редактирование документа невозможно: ведение директивного учета незавершенного производства отключено в <a href = """+СокрЛП(НавигационнаяСсылка)+""">учетной политике</a>.'"));

		ОтключеноУчетнойПолитикой = Истина;
		
	КонецЕсли;

	Элементы.ОтключеноУчетнойПолитикой.Заголовок 	= СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(ЧастиЗаголовка));
	Элементы.ОтключеноУчетнойПолитикой.Видимость 	= ОтключеноУчетнойПолитикой;
	Элементы.Страницы.Доступность 					= НЕ ОтключеноУчетнойПолитикой;
 	Элементы.ГруппаДокументРеализации.Доступность 	= НЕ ОтключеноУчетнойПолитикой;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКлючЗаписи(Период)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Период", 		Период);
	ЗначенияКлюча.Вставить("Организация", 	Объект.Организация);
	
	Возврат РегистрыСведений.CW_УчетнаяПолитика.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции
